Функция ПолучитьПечатнуюФормуАктВР() 
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	Макет = ОбъектНаСервере.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьИнформация = Макет.ПолучитьОбласть("Информация");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	ОбластьПодпись = Макет.ПолучитьОбласть("Подпись"); 
	
	ТабДок = Новый ТабличныйДокумент;
	
	ДатаБезВремени = Формат(ДокументВыполненныхРабот.Дата,"ДФ=dd.MM.yyyy");
	
	ОбластьШапка.Параметры.НомерДоговора = ДокументВыполненныхРабот.Номер;
	ОбластьШапка.Параметры.ДатаДокумента = ДатаБезВремени;
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьИнформация.Параметры.ДатаАкта = ДокументВыполненныхРабот.Дата + 10*24*3600;
	ТабДок.Вывести(ОбластьИнформация);
	
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	Для Каждого Строка Из ДокументВыполненныхРабот.РаботыИУслуги Цикл 	
		ОбластьСтрокаТаблицы.Параметры.Номенклатура = Строка.Номенклатура; 
		ОбластьСтрокаТаблицы.Параметры.Цена = Строка.Цена;
		КонецЦикла;
	
	ТабДок.Вывести(ОбластьСтрокаТаблицы); 
	
	ОбластьИтог.Параметры.Сумма = ДокументВыполненныхРабот.СуммаДокумента;
	ТабДок.Вывести(ОбластьИтог);
	
	ОбластьПодпись.Параметры.Заполнить(ДокументВыполненныхРабот); 
	ТабДок.Вывести(ОбластьПодпись);
	
	Возврат ТабДок;
		
КонецФункции

&НаКлиенте
Процедура ПечатьАкта(Команда)
	ФормаАктВР = ПолучитьПечатнуюФормуАктВР();
	ФормаАктВР.Показать();
	
КонецПроцедуры

